#+begin_export html
---
layout: post
title: Fun with Go's range over function types
permalink: /:title/
tags: [go]
---
#+end_export

#+begin_quote
A quick look at =range=-aware custom iterators.
#+end_quote
--------------

Since Go [[https://tip.golang.org/doc/go1.23][1.23]], it's possible to iterate over user-defined constructs with usual =range= loops, as long as such types conform to the expected interface.

Thanks to this new standard interface, it should be easier to integrate with third-party containers and to more concisely express some algorithms.

* Range over integers

To start off, there's been nice feature since [[https://tip.golang.org/doc/go1.22][1.22]] more or less on the same topic: A terser syntax for iterating over integers in the range =[0, n)=. Similar to APL's [[https://aplwiki.com/wiki/Index_Generator][=Iota=]] primitive.

*Example*: Iterating from =[0, 10)=

#+begin_src go :imports "fmt"
for i := range 10 {
	fmt.Printf("i = %v\n", i)
}
#+end_src

#+RESULTS:
#+begin_example
i = 0
i = 1
i = 2
i = 3
i = 4
i = 5
i = 6
i = 7
i = 8
i = 9
#+end_example

Since the loop variable is optional, if we just want to execute an action multiple times, say =3= times, the code boils down to:

#+begin_src go :imports "fmt"
for range 3 {
	fmt.Println("some-action")
}
#+end_src

#+RESULTS:
: some-action
: some-action
: some-action

This is a nice little improvement in quality of life.

* Range over infinite sequences

We can also range over infinite sequences, for example, Fibonacci's:

#+begin_src go :imports '("fmt" "iter") :main no
func fibs() iter.Seq[int] {
	return func(yield func(int) bool) {
		a, b := 0, 1
		for {
			if !yield(a) {
				return
			}
			a, b = b, a+b
		}
	}
}

func main() {
	for f := range fibs() {
		if f > 100 {
			break
        }
		fmt.Println(f)
	}
}
#+end_src

#+RESULTS:
#+begin_example
0
1
1
2
3
5
8
13
21
34
55
89
#+end_example

Since the iterator returned by =fibs= produces an infinite sequence, we had to explicitly break out of the loop to prevent it from running "forever".

* Range adapters

Lastly, we can write functions that adapts iterators to our needs, for instance, =takeWhile= to keep iterating while a given predicate applied to the current value yields =true=. As an example, we use to iterate over an infinite sequence of strings (=a= =aa= =aaa= ...) and take only the firsts whose lengths are =< 5=.

#+begin_src go :imports '("fmt" "iter") :main no
func appendForever(s string) iter.Seq[string] {
	init := s
	return func(yield func(string) bool) {
		for {
			if !yield(s) {
				return
			}
			s = init + s
		}
	}
}

func takeWhile[V any](p func(V) bool, seq iter.Seq[V]) iter.Seq[V] {
	return func(yield func(V) bool) {
		for v := range seq {
			if !p(v) || !yield(v) {
				return
			}
		}
	}
}

func main() {
	for s := range takeWhile(func(s string) bool { return len(s) < 5 }, appendForever("a")) {
		fmt.Println(s)
	}
}
#+end_src

#+RESULTS:
: a
: aa
: aaa
: aaaa

